## Plan Result (list-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11222018109)



<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
* Update
  * aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99 will be updated in-place
  ~ resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/ListAPI-Prod/ListAPI-Prod"
      ~ max_capacity       = 40 -> 20
      ~ min_capacity       = 15 -> 6
        tags               = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment            = [
                      + {
                          + name  = "DATABASE_READ_PORT"
                          + value = "3306"
                        },
                      + {
                          + name  = "DATABASE_TZ"
                          + value = "US/Central"
                        },
                      + {
                          + name  = "DATABASE_WRITE_PORT"
                          + value = "3306"
                        },
                      + {
                          + name  = "EVENT_BUS_NAME"
                          + value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                      + {
                          + name  = "KINESIS_UNIFIED_EVENT_STREAM"
                          + value = "unified_event"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "SQS_BATCH_DELETE_QUEUE_URL"
                          + value = "https://sqs.us-east-1.amazonaws.com/996905175585/ListAPI-Prod-Sqs-Batch-Delete-Consumer-Queue"
                        },
                      + {
                          + name  = "SQS_PERMLIB_ITEMMAIN_QUEUE_URL"
                          + value = "https://sqs.us-east-1.amazonaws.com/996905175585/PermLib-Prod-ItemMain"
                        },
                      + {
                          + name  = "SQS_PUBLISHER_DATA_QUEUE_URL"
                          + value = "https://sqs.us-east-1.amazonaws.com/996905175585/pocket-publisher-data-queue"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4005/.well-known/apollo/server-health || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/listapi-prod-app:latest"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ListAPI-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4005
                          + hostPort      = 4005
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "CHARACTER_MAP"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:characterMap::"
                        },
                      + {
                          + name      = "DATABASE_READ_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:read_host::"
                        },
                      + {
                          + name      = "DATABASE_READ_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:read_password::"
                        },
                      + {
                          + name      = "DATABASE_READ_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:read_username::"
                        },
                      + {
                          + name      = "DATABASE_WRITE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:write_host::"
                        },
                      + {
                          + name      = "DATABASE_WRITE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:write_password::"
                        },
                      + {
                          + name      = "DATABASE_WRITE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/READITLA_DB:write_username::"
                        },
                      + {
                          + name      = "LETTER_INDEX"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:letterIndex::"
                        },
                      + {
                          + name      = "MD5_RANDOMIZER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:md5Randomizer::"
                        },
                      + {
                          + name      = "PARSER_DOMAIN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ListAPI/Prod/PARSER_DOMAIN"
                        },
                      + {
                          + name      = "POSITION_MAP"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:positionMap::"
                        },
                      + {
                          + name      = "SALT_1"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt1::"
                        },
                      + {
                          + name      = "SALT_2"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/IntMask:salt2::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ListAPI/Prod/SENTRY_DSN"
                        },
                      + {
                          + name      = "SNOWPLOW_ENDPOINT"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ListAPI/Prod/SNOWPLOW_ENDPOINT"
                        },
                      + {
                          + name      = "UNLEASH_ENDPOINT"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ListAPI/Prod/UNLEASH_ENDPOINT"
                        },
                      + {
                          + name      = "UNLEASH_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ListAPI/Prod/UNLEASH_KEY"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/ListAPI-Prod-TaskExecutionRole"
      + family                   = "ListAPI-Prod"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-listapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ListAPI"
        }
      + tags_all                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-listapi"
          + "costCenter"     = "Pocket"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "ListAPI"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/ListAPI-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id               = "arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskRolePolicy"
        name             = "ListAPI-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                            "logs:PutLogEvents",
                            # (4 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:sqs:us-east-1:996905175585:pocket-publisher-data-queue",
                            "arn:aws:sqs:us-east-1:996905175585:PermLib-Prod-ItemMain",
                        ]
                    },
                    # (3 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "app_code"       = "pocket"
            "component_code" = "pocket-listapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "ListAPI"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:1337" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":799,"Program":"tfcmt","SHA1":"5f5d53243ec7a1303770683511f452727367bc75","Target":"list-api-cdk-production","Vars":{},"WorkflowName":"List API"} -->